Статистика работы механизмов/Конфигурация/DataProcessors/_ИмпортОперацийБрокераБКРегион.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_ИмпортОперацийБрокераБКРегион</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИмпорта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимИмпорта</Name>
					<Comment>1 - Только поиск расхождений, 2 - Поиск и устранение расхождений</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСвойства</Name>
					<Comment>Служебное поле, не использовать для работы</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчередьЗагрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьКонтрагентаПоВнебиржевымСделкам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогФайловОТБР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИсточникаДанных</Name>
					<Comment>1- XML, 2 - OTBR</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_ИмпортОперацийБрокераБКРегион/Forms/Форма/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьОбщийВерхнийУровень(Каталог1, Каталог2)
	
	ОбщийВерхнийУровень = "";
	Уровень = "";
	Пока Лев(Каталог1, 1) = Лев(Каталог2, 1) Цикл
		
		Уровень = Уровень + Лев(Каталог1, 1);
		
		Каталог1 = Сред(Каталог1, 2);
		Каталог2 = Сред(Каталог2, 2);
		
		Если Прав(Уровень, 1) = "\" Или Прав(Уровень, 1) = "/" Тогда
			ОбщийВерхнийУровень = ОбщийВерхнийУровень + Уровень;
			Уровень = "";
		КонецЕсли;
		
		Если Каталог1 = "" И Каталог2 = "" Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОбщийВерхнийУровень;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКаталогФайловOTBR(Организация, Период, ОчередьЗагрузки)
	
	Ключ = "КаталогЕжедневныхОтчетовБрокераРегион";

	Если ТипЗнч(Период) = Тип("СтандартныйПериод") Тогда
		
		Если НачалоДня(Период.ДатаНачала) = НачалоДня(Период.ДатаОкончания) Тогда
			
			Если ОчередьЗагрузки > 0 Тогда
				
				МассивКаталогов = СтрРазделить(ПланыВидовХарактеристик.ДополнительныеСведения.КаталогОтчетаДляОрганизации("ВнешниеОбработки.ФайловаяСверкаСБрокеромБКРегион." + Ключ, Организация, Период.ДатаНачала), Символ(0182));
			
				Если МассивКаталогов.Количество() = 0 Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить путь по ключу [КаталогЕжедневныхОтчетовБрокераРегион] для организации [" + Организация + "].");
					Возврат "";
				Иначе
					Возврат МассивКаталогов[ОчередьЗагрузки - 1];
				КонецЕсли;
				
			Иначе
				Возврат ПланыВидовХарактеристик.ДополнительныеСведения.КаталогОтчетаДляОрганизации("ВнешниеОбработки.ФайловаяСверкаСБрокеромБКРегион." + Ключ, Организация, Период.ДатаНачала);
			КонецЕсли;
			
		Иначе
			
			Если ОчередьЗагрузки > 0 Тогда
				
				МассивКаталогов1 = СтрРазделить(ПланыВидовХарактеристик.ДополнительныеСведения.КаталогОтчетаДляОрганизации("ВнешниеОбработки.ФайловаяСверкаСБрокеромБКРегион." + Ключ, Организация, Период.ДатаНачала), Символ(0182));
				МассивКаталогов2 = СтрРазделить(ПланыВидовХарактеристик.ДополнительныеСведения.КаталогОтчетаДляОрганизации("ВнешниеОбработки.ФайловаяСверкаСБрокеромБКРегион." + Ключ, Организация, Период.ДатаОкончания), Символ(0182));
				
				Если МассивКаталогов1.Количество() = 0 Или МассивКаталогов2.Количество() = 0 Тогда
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить путь по ключу [КаталогЕжедневныхОтчетовБрокераРегион] для организации [" + Организация + "].");
					Возврат "";
					
				КонецЕсли;

				Возврат ПолучитьОбщийВерхнийУровень(МассивКаталогов1[ОчередьЗагрузки - 1], МассивКаталогов2[ОчередьЗагрузки - 1]);	
	
			Иначе

				Каталог1 = ПланыВидовХарактеристик.ДополнительныеСведения.КаталогОтчетаДляОрганизации("ВнешниеОбработки.ФайловаяСверкаСБрокеромБКРегион." + Ключ, Организация, Период.ДатаНачала);
				Каталог2 = ПланыВидовХарактеристик.ДополнительныеСведения.КаталогОтчетаДляОрганизации("ВнешниеОбработки.ФайловаяСверкаСБрокеромБКРегион." + Ключ, Организация, Период.ДатаОкончания);
				
				Возврат ПолучитьОбщийВерхнийУровень(Каталог1, Каталог2);
				
			КонецЕсли;
		
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Период) = Тип("Дата") Тогда
		
		Если ОчередьЗагрузки > 0 Тогда
			
			МассивКаталогов = СтрРазделить(ПланыВидовХарактеристик.ДополнительныеСведения.КаталогОтчетаДляОрганизации("ВнешниеОбработки.ФайловаяСверкаСБрокеромБКРегион." + Ключ, Организация, Период), Символ(0182));
			
			Если МассивКаталогов.Количество() = 0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить путь по ключу [КаталогЕжедневныхОтчетовБрокераРегион] для организации [" + Организация + "].");
				Возврат "";
			Иначе
				Возврат МассивКаталогов[ОчередьЗагрузки - 1];
			КонецЕсли;
			
		Иначе
			Возврат ПланыВидовХарактеристик.ДополнительныеСведения.КаталогОтчетаДляОрганизации("ВнешниеОбработки.ФайловаяСверкаСБрокеромБКРегион." + Ключ, Организация, Период);
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьТаблицыНаОснованииДанныхСФормы(Форма)
	
	ДанныеСФормы = Новый Структура();
	
	Для Каждого Элемент Из Форма.ОтображаемыеТаблицы Цикл
		
		ТаблицаДанных = Новый ТаблицаЗначений;
		ТаблицаДанных.Колонки.Добавить("Ссылка");
		ТаблицаДанных.Колонки.Добавить("Описание");
		ТаблицаДанных.Колонки.Добавить("Статус");
		ТаблицаДанных.Колонки.Добавить("НовыеРеквизиты");
		ТаблицаДанных.Колонки.Добавить("ТекущиеРеквизиты");
		ТаблицаДанных.Колонки.Добавить("КодВоВнешнейСистеме");
		ТаблицаДанных.Колонки.Добавить("Флаг");
						
		Для Каждого Строка Из Форма[Элемент.Значение] Цикл
			
			Если Строка.Флаг = Истина Тогда
				
				НоваяСтрока                     = ТаблицаДанных.Добавить();
				НоваяСтрока.Ссылка              = Строка.Ссылка;
				НоваяСтрока.Описание            = Строка.Описание;
				НоваяСтрока.Статус              = Строка.Статус;
				НоваяСтрока.НовыеРеквизиты      = Строка.НовыеРеквизиты;
				НоваяСтрока.ТекущиеРеквизиты    = Строка.ТекущиеРеквизиты;
				НоваяСтрока.КодВоВнешнейСистеме = Строка.КодВоВнешнейСистеме;
				НоваяСтрока.Флаг                = Строка.Флаг;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТаблицаДанных.Количество() > 0 Тогда
			ДанныеСФормы.Вставить(Элемент.Значение, ТаблицаДанных);
		КонецЕСли;
		
	КонецЦикла;
	
	Возврат ДанныеСФормы;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьОтображаемыеТаблицы(Форма)
	
	Для каждого Элемент Из Форма.ОтображаемыеТаблицы Цикл
		Форма[Элемент.Значение].Очистить();
		ЗаголовокТекст = Форма.Элементы["Страница" + Элемент.Значение].Заголовок;
		Форма.Элементы["Страница" + Элемент.Значение].Заголовок = ?(СтрНайти(ЗаголовокТекст, " (") > 0, Лев(ЗаголовокТекст, СтрНайти(ЗаголовокТекст, " (")), ЗаголовокТекст);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПраваПользователя()
	
	Возврат РольДоступна("ПолныеПрава");
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуНаФормеНаСервере(ИмяТаблицы, Заголовок, ИмпортируемыеДанные, ДанныеСФормы)
	
	Если Не ИмпортируемыеДанные.Свойство(ИмяТаблицы) Или ТипЗнч(ИмпортируемыеДанные[ИмяТаблицы]) <> Тип("ТаблицаЗначений") Тогда
		Элементы["Страница" + ИмяТаблицы].Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	КоличествоРасхождений = 0;
	
	Если Объект.ОчередьЗагрузки <> 0 Тогда
		ВидыДоговоровТекущейОчереди = РаботаСВнешнимиСистемами.ПолучитьВидыДоговорДоверительногоУправленияДляОчереди(Объект.Организация, Объект.ОчередьЗагрузки);
	КонецЕсли;
		
	Для Каждого СтрокаИмпортирумыеДанные Из ИмпортируемыеДанные[ИмяТаблицы] Цикл
		
		Если СтрокаИмпортирумыеДанные.Статус = "Нет расхождений" И ЭтаФорма.ОтображатьТолькоРасхождения Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаИмпортирумыеДанные.Статус <> "Нет расхождений" Тогда
			КоличествоРасхождений = КоличествоРасхождений + 1;
		КонецЕсли;
		
		НоваяСтрокаТаблицыНаФорме = ЭтаФорма[ИмяТаблицы].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицыНаФорме, СтрокаИмпортирумыеДанные,, "НовыеРеквизиты, ТекущиеРеквизиты");
		
		НоваяСтрокаТаблицыНаФорме.НовыеРеквизиты      = Новый ХранилищеЗначения(СтрокаИмпортирумыеДанные.НовыеРеквизиты);
		НоваяСтрокаТаблицыНаФорме.ТекущиеРеквизиты    = Новый ХранилищеЗначения(СтрокаИмпортирумыеДанные.ТекущиеРеквизиты);
		НоваяСтрокаТаблицыНаФорме.КодВоВнешнейСистеме = Новый ХранилищеЗначения(СтрокаИмпортирумыеДанные.КодВоВнешнейСистеме);
		
		Если ТипЗнч(СтрокаИмпортирумыеДанные.ОшибкиЧтения) = Тип("Массив") Тогда
			НоваяСтрокаТаблицыНаФорме.ОшибкиЧтения.ЗагрузитьЗначения(СтрокаИмпортирумыеДанные.ОшибкиЧтения);
		КонецЕсли;
		
		НоваяСтрокаТаблицыНаФорме.ЕстьРасхождение = (НоваяСтрокаТаблицыНаФорме.Статус <> "Нет расхождений");
		
		Если СтрокаИмпортирумыеДанные.Статус = "Отсутствует" Или СтрокаИмпортирумыеДанные.Статус = "Ошибка чтения" Или СтрокаИмпортирумыеДанные.Статус = "Нет расхождений" Или СтрокаИмпортирумыеДанные.Статус = "Требуется ручной ввод"  Тогда 
			НоваяСтрокаТаблицыНаФорме.Флаг = Ложь;
		Иначе
			
			Если ДанныеСФормы <> Неопределено И ДанныеСФормы.Свойство(ИмяТаблицы) Тогда
				СтрокаДанныхСФормы = ДанныеСФормы[ИмяТаблицы].Найти(СтрокаИмпортирумыеДанные.Описание, "Описание");
				Если СтрокаДанныхСФормы <> Неопределено Тогда
					НоваяСтрокаТаблицыНаФорме.Флаг = СтрокаДанныхСФормы.Флаг;
				КонецЕсли;
			Иначе
				НоваяСтрокаТаблицыНаФорме.Флаг = Истина;
			КонецЕсли;
			
		КонецЕсли;
			
		Если Объект.ОчередьЗагрузки <> 0 
			И СтрокаИмпортирумыеДанные.Статус = "Новый" И СтрокаИмпортирумыеДанные.СчетДоверительногоУправления <> Справочники.СчетаДоверительногоУправления.ПустаяСсылка() Тогда
			Если ВидыДоговоровТекущейОчереди.Найти(СтрокаИмпортирумыеДанные.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления) = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У документа " + СтрокаИмпортирумыеДанные.Описание + " отличается вид договора счета ДУ от выбранного.");
				НоваяСтрокаТаблицыНаФорме.Флаг = Ложь;
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;
	
	Если КоличествоРасхождений = 0 И ЭтаФорма.ОтображатьТолькоРасхождения Тогда
		Элементы["Страница" + ИмяТаблицы].Видимость = Ложь;
	Иначе
		Элементы["Страница" + ИмяТаблицы].Видимость = Истина;
		
		Если ЭтаФорма.ОтображатьТолькоРасхождения Тогда
			Элементы["Страница" + ИмяТаблицы].Заголовок = Заголовок + " (" + КоличествоРасхождений + ")";
		Иначе
			Элементы["Страница" + ИмяТаблицы].Заголовок = Заголовок + " (" + КоличествоРасхождений + "/" + ЭтаФорма[ИмяТаблицы].Количество() + ")";
		КонецЕсли;
		
		ЭтаФорма[ИмяТаблицы].Сортировать("ЕстьРасхождение УБЫВ");
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьДействиеНаСервере()
	
	Механизм = "_ИмпортОперацийБрокераБКРегион." + ?(Объект.РежимИмпорта = 1, "КомандаОбновить()", "КомандаИмпортировать()");
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(Объект, "Организация, ДатаИмпорта, РежимИмпорта, ОчередьЗагрузки");
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	Объект.ДополнительныеСвойства.Удалить("Ошибки");
	
	Если Объект.РежимИмпорта = 2 Тогда
		СтруктураДанныеСФормы = СформироватьТаблицыНаОснованииДанныхСФормы(ЭтаФорма);	
	КонецЕсли;
	
	ОчиститьОтображаемыеТаблицы(ЭтаФорма);
				
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	
	ОбъектНаСервере.ЗагружатьКонтрагентаПоВнебиржевымСделкам = ОбъектНаСервере.ОпределитьЗагрузкуКонтрагентаПоВнебиржевымСделкам(ОбъектНаСервере.Организация);
	
	ТаблицаФайловРЕПО_М = ЭтаФорма.ФайлыИмпорта.Выгрузить(Новый Структура("ТипФайла", ".xlsx"));
	ТаблицаСделокРЕПО_М = ОбъектНаСервере.ИмпортироватьТаблицуСделокРЕПО_М(ТаблицаФайловРЕПО_М);
	
	ТаблицаФайловИмпортаXML = ЭтаФорма.ФайлыИмпорта.Выгрузить(Новый Структура("ТипФайла", ".xml"));
	
	Если Не ОбъектНаСервере.ФайлИмпортаСоответствуетСхемеXSD(ТаблицаФайловИмпортаXML, "Схема_OTBR") Тогда
		Возврат;	
	КонецЕсли;

	ИмпортируемыеДанные = ОбъектНаСервере.ИмпортироватьИзXMLФайлов_ФорматOTBR(ТаблицаФайловИмпортаXML, ТаблицаСделокРЕПО_М, СтруктураДанныеСФормы);
	
	ЭтаФорма.ФайлыИмпорта.Очистить();
		
	Если ТипЗнч(ИмпортируемыеДанные) = Тип("Структура") Тогда
		
		Если Объект.РежимИмпорта = 1 И ЭтаФорма.СверкаЗаПериод И ЭтаФорма.ПериодСверки.ДатаНачала <> НачалоДня(ЭтаФорма.ПериодСверки.ДатаОкончания) Тогда
			
			Расхождения = Ложь;
			Для Каждого Таблица Из ИмпортируемыеДанные Цикл
				
				Если Расхождения = Истина Тогда
					Прервать;
				КонецЕсли;
				
				Для Каждого СтрокаТаблицы Из Таблица.Значение Цикл
					
					Если СтрокаТаблицы.Статус <> "Нет расхождений" Тогда
						
						Расхождения = Истина;
						
						НоваяСтрока = ЭтаФорма.ДанныеСверкиЗаПериод.Добавить();
						НоваяСтрока.ДатаСверки = Формат(Объект.ДатаИмпорта, "ДФ=dd.MM.yyyy");
						НоваяСтрока.ЕстьРасхождения = Истина;
						Прервать;
							
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			
			Возврат;
			
		Иначе
		
			Для Каждого Элемент Из ЭтаФорма.ОтображаемыеТаблицы Цикл
				ЗаполнитьТаблицуНаФормеНаСервере(Элемент.Значение, Элемент.Представление, ИмпортируемыеДанные, СтруктураДанныеСФормы);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
		
	// отобразим гламурную надпись, если нет расхождений
	Если ЭтаФорма.ОтображатьТолькоРасхождения Тогда
		
		ЕстьРасхождения = Ложь;
		
		Для Каждого Элемент Из Элементы.СтраницыРасхождения.ПодчиненныеЭлементы Цикл
			Если Элемент.Видимость Тогда
				ЕстьРасхождения = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Элементы.ДекорацияРасхожденияОтсутствуют.Видимость = Не ЕстьРасхождения;
		
	Иначе
		Элементы.ДекорацияРасхожденияОтсутствуют.Видимость = Ложь;	
	КонецЕсли;
	
	Если Объект.РежимИмпорта = 2 Тогда // поиск и устранение расхождений
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Импорт данных завершен");
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетСверкиЗаПериод()
	
	ЭтаФорма.ОтчетСверкиЗаПериод.Очистить();
	
	Если ЭтаФорма.ДанныеСверкиЗаПериод.Количество() > 0 Тогда
			
		СтруктураТаблицы = Новый Структура("ДатаСверки, ЕстьРасхождения", "Дата", "Есть расхождения");
		ПараметрыВывода = РаботаСОтчетами.ПодготовитьПараметрыВыводаТаблицыЗначенийВТабличныйДокумент("Отчет за период " + Формат(ЭтаФорма.ПериодСверки.ДатаНачала, "ДФ=dd.MM.yyyy") + " - " + Формат(ЭтаФорма.ПериодСверки.ДатаОкончания, "ДФ=dd.MM.yyyy") + " г.", , , ЭтаФорма.ОтчетСверкиЗаПериод);
		
		РаботаСОтчетами.ВывестиТаблицуЗначенийВТабличныйДокумент(ПараметрыВывода, ЭтаФорма.ДанныеСверкиЗаПериод, СтруктураТаблицы,, Ложь, Истина);
								
		РаботаСОтчетами.УстановитьШиринуКолонок(ПараметрыВывода);
				
	КонецЕсли;
			
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеФайловНаСервере(ПутьКФайламOTBR)
	
	ФайлыКаталога = НайтиФайлы(ПутьКФайламOTBR, "*", Истина);
		
	Для Каждого Файл Из ФайлыКаталога Цикл
		
		ПодстрокаПериод = Формат(Объект.ДатаИмпорта, "ДФ=дд.ММ.гг") + "_-_" + Формат(Объект.ДатаИмпорта, "ДФ=дд.ММ.гг");
		
		Если (Лев(Файл.Имя, 32) = "BrokerReport_" + ПодстрокаПериод И Прав(Файл.Имя, 4) = ".xml") //BrokerReport
			Или (Лев(Файл.Имя, 37) = "BrokerReportREPOM_" + ПодстрокаПериод И Прав(Файл.Имя, 5) = ".xlsx" ) Тогда //BrokerReportREPOM_
			НоваяСтрока = Этаформа.ФайлыИмпорта.Добавить();
			НоваяСтрока.ИмяФайла    = Файл.Имя;
			НоваяСтрока.ТипФайла	= файл.Расширение;
			НоваяСтрока.ДанныеФайла = Новый ДвоичныеДанные(Файл.ПолноеИмя);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНажатийНаГиперссылку(Элемент, Отказ)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ИмяТаблицы    = Элемент.Имя;
	
	Если ТекущиеДанные <> Неопределено Тогда
		Если       Элемент.ТекущийЭлемент.Имя = ИмяТаблицы + "Ссылка" Тогда
			Если ЗначениеЗаполнено(ТекущиеДанные.Ссылка) Тогда
				ОткрытьЗначение(ТекущиеДанные.Ссылка);
			КонецЕсли;
			
		ИначеЕсли Элемент.ТекущийЭлемент.Имя = ИмяТаблицы + "Статус" Тогда
			
			Если ТекущиеДанные.Статус = "Ошибка чтения" Тогда
				Для каждого ЭлементСписка Из ТекущиеДанные.ОшибкиЧтения Цикл
					Сообщить(РаботаСоСтрокамиКлиентСервер.ПодставитьПараметрыВСтроку(ЭлементСписка.Значение, ТекущиеДанные.Описание));
				КонецЦикла;
				
			ИначеЕсли ТекущиеДанные.Статус = "Требуется ручной ввод" Тогда
				СообщениеТекст = "";
				Для каждого ЭлементСписка Из ТекущиеДанные.ОшибкиЧтения Цикл
					СообщениеТекст = СообщениеТекст + РаботаСоСтрокамиКлиентСервер.ПодставитьПараметрыВСтроку(ЭлементСписка.Значение, ТекущиеДанные.Описание);
				КонецЦикла;
				
				ОткрытьЗначение(ТекущиеДанные.Ссылка);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеТекст, ТекущиеДанные.Ссылка);

			Иначе
				ОбновленныеДанные = ОткрытьФормуМодально("ВнешняяОбработка._ИмпортОперацийБрокераБКРегион.Форма.Расхождения",
					Новый Структура("Организация, ДатаИмпорта, НовыеРеквизиты, ТекущиеРеквизиты, ОтображатьТолькоРасхождения",
						Объект.Организация,
						Объект.ДатаИмпорта,
						ТекущиеДанные.НовыеРеквизиты,
						ТекущиеДанные.ТекущиеРеквизиты,
						(ТекущиеДанные.Статус <> "Нет расхождений")));
						
				Если ОбновленныеДанные <> Неопределено Тогда
					ТекущиеДанные.НовыеРеквизиты = ОбновленныеДанные.НовыеРеквизиты;
				КонецЕсли;
			КонецЕсли;
				
		ИначеЕсли Элемент.ТекуЩийЭлемент.Имя = ИмяТаблицы + "Флаг" Тогда
			
			Если ТекущиеДанные.Статус = "Нет расхождений" Или ТекущиеДанные.Статус = "Ошибка чтения" Или ТекущиеДанные.Статус = "Требуется ручной ввод" Тогда
				ТекущиеДанные.Флаг = Ложь;
			Иначе
				ТекущиеДанные.Флаг = Не ТекущиеДанные.Флаг;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Отказ = Истина;
	
КонецПроцедуры 

&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.УдаляемыеДокументы.Очистить();
	ЭтаФорма.ФайлыИмпорта.Очистить();
			
	Если Команда = ЭтаФорма.Команды.КомандаИмпортировать Тогда
		Объект.РежимИмпорта = 2; // поиск и устранение расхождений
	Иначе
		Объект.РежимИмпорта = 1; // только поиск расхождений
	КонецЕсли;
		
	Если ЭтаФорма.СверкаЗаПериод И ЭтаФорма.ПериодСверки.ДатаНачала <> НачалоДня(ЭтаФорма.ПериодСверки.ДатаОкончания) Тогда
		ПутьКФайламOTBR = ПолучитьКаталогФайловOTBR(Объект.Организация, Объект.ДатаИмпорта, Объект.ОчередьЗагрузки);
	Иначе
		ПутьКФайламOTBR = Объект.КаталогФайловОТБР;
	КонецЕсли;
	
	ПолучитьДанныеФайловНаСервере(ПутьКФайламOTBR);
				
	Если ЭтаФорма.ФайлыИмпорта.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В папке [" + Объект.КаталогФайловОТБР + "] отсутствуют файлы за период [" + Формат(Объект.ДатаИмпорта, "ДФ=dd.MM.yyyy")  + "]. Или наименования файлов не соостветствуют формату [BrokerReport_ДД.ММ.ГГ_-_ДД.ММ.ГГ_КодКлиента.xml]");
		Возврат;
	КонецЕсли;
		
	ВыполнитьДействиеНаСервере();
			
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	ОтображаемыеТаблицы.Добавить("БиржевыеСделки"          , "Бирж. сделки");
	ОтображаемыеТаблицы.Добавить("ИзмененияСделок"         , "Изм. сделок");
	ОтображаемыеТаблицы.Добавить("БиржевыеСделкиРЕПО1"     , "Бирж. сделки РЕПО #1");
	ОтображаемыеТаблицы.Добавить("БиржевыеСделкиРЕПО2"     , "Бирж. сделки РЕПО #2");
	ОтображаемыеТаблицы.Добавить("ИзмененияСделокРЕПО2"    , "Изм. сделок РЕПО #2");
	ОтображаемыеТаблицы.Добавить("ВнебиржевыеСделки"       , "Внебирж. сделки");
	ОтображаемыеТаблицы.Добавить("ВнебиржевыеСделкиРЕПО"   , "Внебирж. сделки РЕПО");
	ОтображаемыеТаблицы.Добавить("СделкиСВалютой"          , "Сделки с вал.");
	ОтображаемыеТаблицы.Добавить("ФорвардыПоставочные"     , "Форварды поставочные");
	ОтображаемыеТаблицы.Добавить("ИсполненияБиржевыхСделок", "Исполн. бирж. сделок");
	ОтображаемыеТаблицы.Добавить("НачисленияКомиссии"      , "Начисл. комиссии");
	ОтображаемыеТаблицы.Добавить("ОплатыКомиссии"          , "Оплаты комиссии");
	ОтображаемыеТаблицы.Добавить("ПоставкиЦенныхБумаг"     , "Поставки ц/б");
	ОтображаемыеТаблицы.Добавить("ОплатыВнебиржевыхСделок" , "Оплаты внеб. сделок");
	ОтображаемыеТаблицы.Добавить("ОплатыБиржевыхСделок"    , "Оплаты бирж. сделок");
	ОтображаемыеТаблицы.Добавить("ВариационнаяМаржа"       , "Вар. маржа");
	ОтображаемыеТаблицы.Добавить("ПереводыДенежныхСредств" , "Переводы д/с");
	ОтображаемыеТаблицы.Добавить("ОплатыПоПогашениям"      , "Оплаты по погашениям");
	ОтображаемыеТаблицы.Добавить("ОплатыПоВозвратуКупона"  , "Возвраты купона");
	ОтображаемыеТаблицы.Добавить("ОтменыСделок"            , "Отмены сделок");
	ОтображаемыеТаблицы.Добавить("СписанияЦенныхБумаг"     , "Списания ц/б");
	ОтображаемыеТаблицы.Добавить("СделкиСПФИ"              , "Сделки СПФИ");
	ОтображаемыеТаблицы.Добавить("МаржаСПФИ"               , "Маржа СПФИ");
		
	// заполним значения по умолчанию
	Если Не ЗначениеЗаполнено(Объект.ДатаИмпорта) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДанныеОбщероссийскогоКалендаря.Дата КАК Дата
			|ПОМЕСТИТЬ _ТорговыеРабочиеДни
			|ИЗ
			|	РегистрСведений.ДанныеКалендаря КАК ДанныеОбщероссийскогоКалендаря
			|ГДЕ
			|	ДанныеОбщероссийскогоКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
			|	И ДанныеОбщероссийскогоКалендаря.Дата < &Дата
			|	И ДанныеОбщероссийскогоКалендаря.Дата > &МинусМесяц
			|	И ДанныеОбщероссийскогоКалендаря.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДанныеКалендаряКотировок.Дата
			|ИЗ
			|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаряКотировок
			|ГДЕ
			|	ДанныеКалендаряКотировок.Календарь = &КалендарьКотировок
			|	И ДанныеКалендаряКотировок.Дата < &Дата
			|	И ДанныеКалендаряКотировок.Дата > &МинусМесяц
			|	И ДанныеКалендаряКотировок.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	МАКСИМУМ(_ТорговыеРабочиеДни.Дата) КАК ДатаИмпорта
			|ИЗ
			|	_ТорговыеРабочиеДни КАК _ТорговыеРабочиеДни";
	
		Запрос.УстановитьПараметр("Дата"              , НачалоДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("МинусМесяц"        , ДобавитьМесяц(ТекущаяДата(), -1));
		Запрос.УстановитьПараметр("КалендарьКотировок", ОбщегоНазначения.ПолучитьИменованныйОбъект("КалендарьКотировок"));
	
		Результат = Запрос.Выполнить().Выгрузить();
			
		Объект.ДатаИмпорта = Результат[0].ДатаИмпорта; //ТекущаяДата() - 86400;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	КонецЕсли;
	
	ОбработатьОчередиЗагрузкиНаСервере();

	Если РольДоступна("ПолныеПрава") Тогда
		ЭтаФорма.ПериодСверки.ДатаНачала    = Объект.ДатаИмпорта;
		ЭтаФорма.ПериодСверки.ДатаОкончания = КонецДня(Объект.ДатаИмпорта);
	КонецЕсли;
	
	ЭтаФорма.СверкаЗаПериод              = РольДоступна("ПолныеПрава");
	ЭтаФорма.ОтображатьТолькоРасхождения = Истина;
	
	Элементы.ДекорацияРасхожденияОтсутствуют.Видимость = Ложь;
	Элементы.ГруппаОтчетСверкиЗаПериод.Видимость       = Ложь;
	Элементы.ПериодСверки.Видимость                    = ЭтаФорма.СверкаЗаПериод;
	Элементы.ДатаИмпорта.Видимость                     = Не ЭтаФорма.СверкаЗаПериод;

КонецПроцедуры

&НаСервере
Процедура ОбработатьОчередиЗагрузкиНаСервере()
		 
	ИмпортироватьИзНесколькихФайлов = РаботаСВнешнимиСистемами.ИмпортРазделенПоОчередям(Объект.Организация); 	
		
	Если ИмпортироватьИзНесколькихФайлов Тогда
		Объект.ОчередьЗагрузки = 2;
	Иначе
		Объект.ОчередьЗагрузки = 0;
	КонецЕсли;
	
	Элементы.ОчередьЗагрузки.Видимость = ИмпортироватьИзНесколькихФайлов;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДатаИмпортаПриИзменении(Неопределено);
		
	//Объект.ДатаИмпорта    = Дата(2018, 12, 05);
	//Объект.ИмяФайлаДанных = "\\am-1c00\Арчи\Data\MX_Operations_2018-12-05_2018-12-05.xml";
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если РольДоступна("ПолныеПрава") Тогда
		ПроверяемыеРеквизиты.Добавить("ПериодСверки");
	КонецЕсли;
	
	Если ЭтаФорма.ПериодСверки.ДатаНачала > ЭтаФорма.ПериодСверки.ДатаОкончания Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Некорректно указан период сверки", ЭтаФорма, "ПериодСверки",, Отказ);	
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ОбработатьОтветПользователя(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		КомандаОбновить(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросИПолучитьКаталогФайловOTBR(Организация, Период)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Ответ = Вопрос("Изменить путь к каталогу с файлами?", Режим, 0);
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	//Объект.КаталогФайловОТБР = ПолучитьКаталогФайловOTBR(Организация, Период);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОбработатьОчередиЗагрузкиНаСервере();
	
	Объект.КаталогФайловОТБР = ПолучитьКаталогФайловOTBR(Объект.Организация, ?(ЭтаФорма.СверкаЗаПериод, ЭтаФорма.ПериодСверки, Объект.ДатаИмпорта), Объект.ОчередьЗагрузки);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьОтветПользователя", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, "Получить данные из файлов OTBR?", РежимДиалогаВопрос.ДаНет);
		
КонецПроцедуры

&НаКлиенте
Процедура ДатаИмпортаПриИзменении(Элемент)
	
	Объект.КаталогФайловОТБР = ПолучитьКаталогФайловOTBR(Объект.Организация, Объект.ДатаИмпорта, Объект.ОчередьЗагрузки);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьОтветПользователя", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, "Получить данные из файлов OTBR?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСверкиПриИзменении(Элемент)
	
	Объект.КаталогФайловОТБР = ПолучитьКаталогФайловOTBR(Объект.Организация, ЭтаФорма.ПериодСверки, Объект.ОчередьЗагрузки);
		
	Элементы.ОтображатьТолькоРасхождения.Доступность = (ЭтаФорма.ПериодСверки.ДатаНачала = НачалоДня(ЭтаФорма.ПериодСверки.ДатаОкончания));
	ЭтаФорма.ОтображатьТолькоРасхождения = ?(ЭтаФорма.ПериодСверки.ДатаНачала <> НачалоДня(ЭтаФорма.ПериодСверки.ДатаОкончания), Истина, ЭтаФорма.ОтображатьТолькоРасхождения); 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьОтветПользователя", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, "Получить данные из файлов OTBR?", РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура ОтображатьТолькоРасхожденияПриИзменении(Элемент)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьОтветПользователя", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, "Получить данные из файлов OTBR?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогФайловОТБРНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораКаталога                    = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораКаталога.Каталог            = Объект.КаталогФайловОТБР;
	ДиалогВыбораКаталога.МножественныйВыбор = Ложь;
	ДиалогВыбораКаталога.Заголовок	        = "Выберите каталог с отчетами";
	
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		Объект.КаталогФайловОТБР = ДиалогВыбораКаталога.Каталог;
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьОтветПользователя", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, "Получить данные из файлов OTBR?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытиеФайловКаталогов(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Адрес = "";
	
	Если Не ПустаяСтрока(Объект.КаталогФайловОТБР) Тогда
		Адрес = Объект.КаталогФайловОТБР;
	КонецЕсли;
	
	Если Адрес <> "" Тогда
		ЗапуститьПриложение(Адрес);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаДанныхПриИзменении(Элемент)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьОтветПользователя", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, "Получить данные из файлов OTBR?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура БиржевыеСделкиПередНачаломИзменения(Элемент, Отказ)
	
	ОбработкаНажатийНаГиперссылку(Элемент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура БиржевыеСделкиРЕПО1ПередНачаломИзменения(Элемент, Отказ)
	
	ОбработкаНажатийНаГиперссылку(Элемент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура БиржевыеСделкиРЕПО2ПередНачаломИзменения(Элемент, Отказ)
	
	ОбработкаНажатийНаГиперссылку(Элемент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмененияСделокПередНачаломИзменения(Элемент, Отказ)
	
	ОбработкаНажатийНаГиперссылку(Элемент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмененияСделокРЕПО2ПередНачаломИзменения(Элемент, Отказ)
	
	ОбработкаНажатийНаГиперссылку(Элемент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполненияБиржевыхСделокПередНачаломИзменения(Элемент, Отказ)
	
	ОбработкаНажатийНаГиперссылку(Элемент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияКомиссииПередНачаломИзменения(Элемент, Отказ)
	
	ОбработкаНажатийНаГиперссылку(Элемент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатыКомиссииПередНачаломИзменения(Элемент, Отказ)
	
	ОбработкаНажатийНаГиперссылку(Элемент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнебиржевыеСделкиПередНачаломИзменения(Элемент, Отказ)
	
	ОбработкаНажатийНаГиперссылку(Элемент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнебиржевыеСделкиРЕПОПередНачаломИзменения(Элемент, Отказ)
	
	ОбработкаНажатийНаГиперссылку(Элемент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоставкиЦенныхБумагПередНачаломИзменения(Элемент, Отказ)
	
	ОбработкаНажатийНаГиперссылку(Элемент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатыВнебиржевыхСделокПередНачаломИзменения(Элемент, Отказ)
	
	ОбработкаНажатийНаГиперссылку(Элемент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариационнаяМаржаПередНачаломИзменения(Элемент, Отказ)
	
	ОбработкаНажатийНаГиперссылку(Элемент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура СделкиСВалютойПередНачаломИзменения(Элемент, Отказ)
	
	ОбработкаНажатийНаГиперссылку(Элемент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ФорвардыПоставочныеПередНачаломИзменения(Элемент, Отказ)
	
	ОбработкаНажатийНаГиперссылку(Элемент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереводыДенежныхСредствПередНачаломИзменения(Элемент, Отказ)
	
	ОбработкаНажатийНаГиперссылку(Элемент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатыБиржевыхСделокПередНачаломИзменения(Элемент, Отказ)
	
	ОбработкаНажатийНаГиперссылку(Элемент, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ОплатыПоПогашениямПередНачаломИзменения(Элемент, Отказ)
	
	ОбработкаНажатийНаГиперссылку(Элемент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменыСделокПередНачаломИзменения(Элемент, Отказ)
	
	ОбработкаНажатийНаГиперссылку(Элемент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура СписанияЦенныхБумагПередНачаломИзменения(Элемент, Отказ)
	
	ОбработкаНажатийНаГиперссылку(Элемент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатыПоВозвратуКупонаПередНачаломИзменения(Элемент, Отказ)
	
	ОбработкаНажатийНаГиперссылку(Элемент, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВсеФлажкиТекущейТаблицы(ИмяТаблицы, Флаг)
	
	ПолныеПрава = ПраваПользователя();
	
	Для Каждого СтрокаТаблицы Из ЭтаФорма[ИмяТаблицы] Цикл
		
		Если СтрокаТаблицы.Статус = "Отсутствует" Тогда // под полными правами отмечаем сразу все документы для удаления. 
			
			СтрокаТаблицы.Флаг = ?((ПолныеПрава Или Флаг = Ложь), Флаг, СтрокаТаблицы.Флаг);
			
		ИначеЕсли СтрокаТаблицы.Статус = "Ошибка чтения" Или СтрокаТаблицы.Статус = "Нет расхождений" Или СтрокаТаблицы.Статус = "Требуется ручной ввод" Тогда
			
			СтрокаТаблицы.Флаг = Ложь;
			
		Иначе
			
			СтрокаТаблицы.Флаг = Флаг;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьВсеФлажки(Команда)
	
	ИмяТаблицы = СтрЗаменить(ЭтаФорма.ТекущийЭлемент.Имя, Команда.Имя, "");
	ИзменитьВсеФлажкиТекущейТаблицы(ИмяТаблицы, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьВсеФлажки(Команда)
	
	ИмяТаблицы = СтрЗаменить(ЭтаФорма.ТекущийЭлемент.Имя, Команда.Имя, "");
	ИзменитьВсеФлажкиТекущейТаблицы(ИмяТаблицы, Истина);
	
КонецПроцедуры 

&НаКлиенте
Функция ПроверитьНаличиеДокументовДляУдаления()
	
	ФлагНаличияДокументов = Ложь;
	Для Каждого Элемент Из ЭтаФорма.ОтображаемыеТаблицы Цикл
		
		Для Каждого СтрокаТаблицы  Из ЭтаФорма[Элемент.Значение] Цикл
			
			Если СтрокаТаблицы.Статус = "Отсутствует" Тогда
				
				ФлагНаличияДокументов = Истина;
				Если СтрокаТаблицы.Флаг = Истина Тогда
					ЭтаФорма.УдаляемыеДокументы.Добавить(СтрокаТаблицы.Ссылка);
				КонецЕсли;
				
			КонецЕсли;	

		КонецЦикла;
			
	КонецЦикла;
	Возврат ФлагНаличияДокументов;
	
КонецФункции
////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	Если ЭтаФорма.СверкаЗаПериод Тогда
		
		ЭтаФорма.ДанныеСверкиЗаПериод.Очистить();

		Объект.ДатаИмпорта = ЭтаФорма.ПериодСверки.ДатаНачала;
		
		Пока Объект.ДатаИмпорта <= ЭтаФорма.ПериодСверки.ДатаОкончания Цикл
			
			ВыполнитьДействие(Команда);
			Объект.ДатаИмпорта = Объект.ДатаИмпорта + 86400;
			
		КонецЦикла;
		
		Объект.ДатаИмпорта = ЭтаФорма.ПериодСверки.ДатаНачала; //Вернем дате импорта начальное значение.
		
		Если ЭтаФорма.ПериодСверки.ДатаНачала <> НачалоДня(ЭтаФорма.ПериодСверки.ДатаОкончания) Тогда
			СформироватьОтчетСверкиЗаПериод();
			Элементы.ДекорацияРасхожденияОтсутствуют.Видимость = ЭтаФорма.ДанныеСверкиЗаПериод.Количество() = 0;	
		КонецЕсли;
		
		Элементы.СтраницыРасхождения.Видимость       = (ЭтаФорма.ПериодСверки.ДатаНачала = НачалоДня(ЭтаФорма.ПериодСверки.ДатаОкончания));
		Элементы.ГруппаОтчетСверкиЗаПериод.Видимость = (ЭтаФорма.ПериодСверки.ДатаНачала <> НачалоДня(ЭтаФорма.ПериодСверки.ДатаОкончания) И ЭтаФорма.ДанныеСверкиЗаПериод.Количество() > 0);
		
	Иначе
		ВыполнитьДействие(Команда);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИмпортировать(Команда)
	
	Если ЭтотОбъект.СверкаЗаПериод И ЭтотОбъект.ПериодСверки.ДатаНачала <> НачалоДня(ЭтотОбъект.ПериодСверки.ДатаОкончания) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Команда [Импортировать] недоступна при заданном периоде. Импорт операций осуществляется только за один день.");//, ЭтотОбъект, "ПериодСверки");
		Возврат;
	КонецЕсли;
	
	ФлагНаличияДокументов = ПроверитьНаличиеДокументовДляУдаления();
	
	Если ЭтотОбъект.УдаляемыеДокументы.Количество() > 0 Тогда
		
		ПрерватьИмпорт = ОткрытьФормуМодально("ВнешняяОбработка._ИмпортОперацийБрокераБКРегион.Форма.УдаляемыеДокументы", Новый Структура("УдаляемыеДокументы", ЭтотОбъект.УдаляемыеДокументы));
		
		Если ПрерватьИмпорт = Неопределено Или ПрерватьИмпорт = Истина Тогда
			ЭтотОбъект.УдаляемыеДокументы.Очистить();
			Возврат;
		Иначе
			ВыполнитьДействие(Команда);
		КонецЕсли;
				
	Иначе
		
		ВыполнитьДействие(Команда);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчередьЗагрузкиПриИзменении(Элемент)
	
	Объект.КаталогФайловОТБР = ПолучитьКаталогФайловOTBR(Объект.Организация, ?(ЭтаФорма.СверкаЗаПериод, ЭтаФорма.ПериодСверки, Объект.ДатаИмпорта), Объект.ОчередьЗагрузки);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьОтветПользователя", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, "Получить данные из файлов OTBR?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры
